ilogicsBoss/Board/CustomBoard/Hardware/ILOGICS/avr/variants/MPAINO-48A48R(T)/pins_arduino.h
};

const uint8_t PROGMEM digital_pin_to_timer_PGM[] = {
	// TIMERS		
	// -------------------------------------------		
	NOT_ON_TIMER	, // PE 0 ** 0 ** USART0_RX	
	NOT_ON_TIMER	, // PE 1 ** 1 ** USART0_TX	
	TIMER3B	, // PE 4 ** 2 ** PWM2	
	TIMER3C	, // PE 5 ** 3 ** PWM3	
	TIMER0B	, // PG 5 ** 4 ** PWM4	
	TIMER3A	, // PE 3 ** 5 ** PWM5	
	TIMER4A	, // PH 3 ** 6 ** PWM6	
	TIMER4B	, // PH 4 ** 7 ** PWM7	
	TIMER4C	, // PH 5 ** 8 ** PWM8	
	TIMER2B	, // PH 6 ** 9 ** PWM9	
	TIMER2A	, // PB 4 ** 10 ** PWM10	
	TIMER1A	, // PB 5 ** 11 ** PWM11	
	TIMER1B	, // PB 6 ** 12 ** PWM12	
	TIMER1C	, // PB 7 ** 13 ** PWM13	
	NOT_ON_TIMER	, // PJ 1 ** 14 ** USART3_TX	
	NOT_ON_TIMER	, // PJ 0 ** 15 ** USART3_RX	
	NOT_ON_TIMER	, // PH 1 ** 16 ** USART2_TX	
	NOT_ON_TIMER	, // PH 0 ** 17 ** USART2_RX	
	NOT_ON_TIMER	, // PD 3 ** 18 ** USART1_TX	
	NOT_ON_TIMER	, // PD 2 ** 19 ** USART1_RX	
	NOT_ON_TIMER	, // PD 1 ** 20 ** I2C_SDA	
	NOT_ON_TIMER	, // PD 0 ** 21 ** I2C_SCL	
	NOT_ON_TIMER	, // PA 0 ** 22 ** D22	
	NOT_ON_TIMER	, // PA 1 ** 23 ** D23	
	NOT_ON_TIMER	, // PA 2 ** 24 ** D24	
	NOT_ON_TIMER	, // PA 3 ** 25 ** D25	
	NOT_ON_TIMER	, // PA 4 ** 26 ** D26	
	NOT_ON_TIMER	, // PA 5 ** 27 ** D27	
	NOT_ON_TIMER	, // PA 6 ** 28 ** D28	
	NOT_ON_TIMER	, // PA 7 ** 29 ** D29	
	NOT_ON_TIMER	, // PC 7 ** 30 ** D30	
	NOT_ON_TIMER	, // PC 6 ** 31 ** D31	
	NOT_ON_TIMER	, // PC 5 ** 32 ** D32	
	NOT_ON_TIMER	, // PC 4 ** 33 ** D33	
	NOT_ON_TIMER	, // PC 3 ** 34 ** D34	
	NOT_ON_TIMER	, // PC 2 ** 35 ** D35	
	NOT_ON_TIMER	, // PC 1 ** 36 ** D36	
	NOT_ON_TIMER	, // PC 0 ** 37 ** D37	
	NOT_ON_TIMER	, // PD 7 ** 38 ** D38	
	NOT_ON_TIMER	, // PG 2 ** 39 ** D39	
	NOT_ON_TIMER	, // PG 1 ** 40 ** D40	
	NOT_ON_TIMER	, // PG 0 ** 41 ** D41	
	NOT_ON_TIMER	, // PL 7 ** 42 ** D42	
	NOT_ON_TIMER	, // PL 6 ** 43 ** D43	
	TIMER5C	, // PL 5 ** 44 ** D44	
	TIMER5B	, // PL 4 ** 45 ** D45	
	TIMER5A	, // PL 3 ** 46 ** D46	
	NOT_ON_TIMER	, // PL 2 ** 47 ** D47	
	NOT_ON_TIMER	, // PL 1 ** 48 ** D48	
	NOT_ON_TIMER	, // PL 0 ** 49 ** D49	
	NOT_ON_TIMER	, // PB 3 ** 50 ** SPI_MISO	
	NOT_ON_TIMER	, // PB 2 ** 51 ** SPI_MOSI	
	NOT_ON_TIMER	, // PB 1 ** 52 ** SPI_SCK	
	NOT_ON_TIMER	, // PB 0 ** 53 ** SPI_SS	
	NOT_ON_TIMER	, // PF 0 ** 54 ** A0	
	NOT_ON_TIMER	, // PF 1 ** 55 ** A1	
	NOT_ON_TIMER	, // PF 2 ** 56 ** A2	
	NOT_ON_TIMER	, // PF 3 ** 57 ** A3	
	NOT_ON_TIMER	, // PF 4 ** 58 ** A4	
	NOT_ON_TIMER	, // PF 5 ** 59 ** A5	
	NOT_ON_TIMER	, // PF 6 ** 60 ** A6	
	NOT_ON_TIMER	, // PF 7 ** 61 ** A7	
	NOT_ON_TIMER	, // PK 0 ** 62 ** A8	
	NOT_ON_TIMER	, // PK 1 ** 63 ** A9	
	NOT_ON_TIMER	, // PK 2 ** 64 ** A10	
	NOT_ON_TIMER	, // PK 3 ** 65 ** A11	
	NOT_ON_TIMER	, // PK 4 ** 66 ** A12	
	NOT_ON_TIMER	, // PK 5 ** 67 ** A13	
	NOT_ON_TIMER	, // PK 6 ** 68 ** A14	
	NOT_ON_TIMER	, // PK 7 ** 69 ** A15
	NOT_ON_TIMER	, // PD 7 ** 70 ** D70	
	NOT_ON_TIMER	, // PD 6 ** 71 ** D71	
	NOT_ON_TIMER	, // PE 6 ** 72 ** D72	
	NOT_ON_TIMER	, // PH 7 ** 73 ** D73	
	NOT_ON_TIMER	, // PL 2 ** 74 ** D74	
	NOT_ON_TIMER	, // PD 4 ** 75 ** D75	
	NOT_ON_TIMER	, // PD 5 ** 76 ** D76	
	NOT_ON_TIMER	, // PE 7 ** 77 ** D77	
	NOT_ON_TIMER	, // PG 3 ** 78 ** D78	
	NOT_ON_TIMER	, // PG 4 ** 79 ** D79	
	NOT_ON_TIMER	, // PJ 2 ** 80 ** D80	
	NOT_ON_TIMER	, // PJ 3 ** 81 ** D81	
	NOT_ON_TIMER	, // PJ 4 ** 82 ** D82	
	NOT_ON_TIMER	, // PJ 5 ** 83 ** D83	
	NOT_ON_TIMER	, // PJ 6 ** 84 ** D84	
	NOT_ON_TIMER	, // PJ 7 ** 85 ** D85
	NOT_ON_TIMER	, // 86
	NOT_ON_TIMER	, // 87
	NOT_ON_TIMER	, // 88
	NOT_ON_TIMER	, // 89
	NOT_ON_TIMER	, // 90
	NOT_ON_TIMER	, // PJ 7 ** 91 ** D85
	NOT_ON_TIMER	, // PJ 7 ** 92 ** D85
	NOT_ON_TIMER	, // PJ 7 ** 93 ** D85
	NOT_ON_TIMER	, // PJ 7 ** 94 ** D85
	NOT_ON_TIMER	, // PJ 7 ** 95 ** D85
	NOT_ON_TIMER	, // PJ 7 ** 96 ** D85
	NOT_ON_TIMER	, // PJ 7 ** 97 ** D85
	NOT_ON_TIMER	, // PJ 7 ** 98 ** D85
	NOT_ON_TIMER	, // PJ 7 ** 99 ** D85
	NOT_ON_TIMER	, // PJ 7 ** 100 ** D85
	NOT_ON_TIMER	, // PJ 7 ** 101 ** D85
	NOT_ON_TIMER	, // PJ 7 ** 102 ** D85
	NOT_ON_TIMER	, // PJ 7 ** 103 ** D85
	NOT_ON_TIMER	, // PJ 7 ** 104 ** D85
	NOT_ON_TIMER	, // PJ 7 ** 105 ** D85
	NOT_ON_TIMER	, // PJ 7 ** 106 ** D85
	NOT_ON_TIMER	, // PJ 7 ** 107 ** D85
	NOT_ON_TIMER	, // PJ 7 ** 108 ** D85
	NOT_ON_TIMER	, // PJ 7 ** 109 ** D85
	NOT_ON_TIMER	, // PJ 7 ** 110 ** D85
	NOT_ON_TIMER	, // PJ 7 ** 111 ** D85
	NOT_ON_TIMER	, // PJ 7 ** 112 ** D85
	NOT_ON_TIMER	, // PJ 7 ** 113 ** D85
	NOT_ON_TIMER	, // PJ 7 ** 114 ** D85
	NOT_ON_TIMER	, // PJ 7 ** 115 ** D85
	NOT_ON_TIMER	, // PJ 7 ** 116 ** D85
	NOT_ON_TIMER	, // PJ 7 ** 117 ** D85
	NOT_ON_TIMER	, // PJ 7 ** 118 ** D85
	NOT_ON_TIMER	, // PJ 7 ** 119 * D85
	NOT_ON_TIMER	, // PJ 7 ** 120 ** D85
	NOT_ON_TIMER	, // PJ 7 ** 121 ** D85
	NOT_ON_TIMER	, // PJ 7 ** 122 ** D85
	NOT_ON_TIMER	, // PJ 7 ** 123 ** D85
	NOT_ON_TIMER	, // PJ 7 ** 124 ** D85
	NOT_ON_TIMER	, // PJ 7 ** 125 ** D85
	NOT_ON_TIMER	, // PJ 7 ** 126 ** D85
	NOT_ON_TIMER	, // PJ 7 ** 127 ** D85
	NOT_ON_TIMER	, // PJ 7 ** 128 ** D85
	NOT_ON_TIMER	, // PJ 7 ** 129 ** D85
	TIMER1A	, // PB 5 ** 130 ** PWM11	
	TIMER1B	, // PB 6 ** 131 ** PWM12	
	TIMER1C	, // PB 7 ** 132 ** PWM13	
	TIMER5A	, // PL 3 ** 133 ** D46	
	TIMER5B	, // PL 4 ** 134 ** D45	
	TIMER5C	, // PL 5 ** 135 ** D44	
	TIMER3A	, // PE 3 ** 136 ** PWM5	
	TIMER3B	, // PE 4 ** 137 ** PWM2		
	TIMER3C	, // PE 5 ** 138 ** PWM3	
	TIMER4A	, // PH 3 ** 139 ** PWM6	
	TIMER4B	, // PH 4 ** 140 ** PWM7	
	TIMER4C	, // PH 5 ** 141 ** PWM8		
	NOT_ON_TIMER	, // PL1 ** 142 ** SLED
	NOT_ON_TIMER	, // PB0 ** 143 ** CS1 53
	NOT_ON_TIMER	, // PG2 ** 144 ** CS2 39
	NOT_ON_TIMER	, // PG1 ** 145 ** CS3 40
	NOT_ON_TIMER	, // PG0 ** 146 ** CS4 41
	NOT_ON_TIMER	, // PL7 ** 147 ** CS5 42
	NOT_ON_TIMER	, // PB3 ** 148 ** MISO 50
	NOT_ON_TIMER	, // PB2 ** 149 ** MOSI 51
	NOT_ON_TIMER	, // PB1 ** 150 ** SCK 52
	
};

#endif

// These serial port names are intended to allow libraries and architecture-neutral
// sketches to automatically default to the correct port name for a particular type
// of use.  For example, a GPS module would normally connect to SERIAL_PORT_HARDWARE_OPEN,
// the first hardware serial port whose RX/TX pins are not dedicated to another use.
//
// SERIAL_PORT_MONITOR        Port which normally prints to the Arduino Serial Monitor
//
// SERIAL_PORT_USBVIRTUAL     Port which is USB virtual serial
//
// SERIAL_PORT_LINUXBRIDGE    Port which connects to a Linux system via Bridge library
//
// SERIAL_PORT_HARDWARE       Hardware serial port, physical RX & TX pins.
//
// SERIAL_PORT_HARDWARE_OPEN  Hardware serial ports which are open for use.  Their RX & TX
//                            pins are NOT connected to anything by default.
#define SERIAL_PORT_MONITOR         Serial
#define SERIAL_PORT_HARDWARE        Serial
#define SERIAL_PORT_HARDWARE1       Serial1
#define SERIAL_PORT_HARDWARE2       Serial2
#define SERIAL_PORT_HARDWARE3       Serial3
#define SERIAL_PORT_HARDWARE_OPEN   Serial1
#define SERIAL_PORT_HARDWARE_OPEN1  Serial2
#define SERIAL_PORT_HARDWARE_OPEN2  Serial3

#endif
